EDT/УТ/src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МоделиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЕдиницыОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеПовреждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СтатусыОборудования/СтатусыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СвязанноеОборудование/СвязанноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанноеОборудование</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусМонтирования</name>
    <type>
      <types>EnumRef.СтатусыМонтированияОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОборудованиеВладелец</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеПодчиненное</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КомплектыОборудования/КомплектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыТранспорта/ДополнительныеПараметрыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдаленноеЗакрытиеРейсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиЧеков</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяРольТранспорта</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйСервер</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </resources>
  <resources>
    <name>ФорматАвтотранспорта</name>
    <type>
      <types>CatalogRef.ФорматыАвтотранспорта</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоШтатныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СтатусыМонтированияОборудования/СтатусыМонтированияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМонтированияОборудования</name>
  <enumValues>
    <name>Смонтировано</name>
  </enumValues>
  <enumValues>
    <name>Демонтировано</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыОборудования/ТипыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОборудования</name>
  <enumValues>
    <name>ПринтерЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>Смартфон</name>
  </enumValues>
  <enumValues>
    <name>Планшет</name>
  </enumValues>
  <enumValues>
    <name>ТерминалПриемаОплатыПоКарте</name>
  </enumValues>
  <enumValues>
    <name>SIMКарта</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/СведенияОКомплектеОборудования/СведенияОКомплектеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СведенияОКомплектеОборудования</name>
  <registerRecords>InformationRegister.КомплектыОборудования</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазукомплектацияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/Catalogs/МоделиОборудования/МоделиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиОборудования</name>
  <predefined>
    <items>
      <name>SIMКарта</name>
      <description>SIMКарта</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/Оборудование/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Асеев 25.04.2024 (Задача № 5265)>>>
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.РазукомплектоватьОборудование.Видимость = Ложь;
	Иначе
		ЗаполнитьДанныеОборудования();	
	КонецЕсли;
	//Асеев 25.04.2024 (Задача № 5265)<<<
	
	//Асеев 05.04.2024 (Задача № 5251)>>>
	ТипОборудованияПриИзмененииНаСервере();
	//Асеев 05.04.2024 (Задача № 5251)<<<
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОборудования()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыОборудованияСрезПервых.СтатусОборудования КАК Статус,
	|	ВЫБОР
	|		КОГДА УчетОборудованияСрезПоследних.ВыдачаНаДлительныйСрок
	|			ТОГДА УчетОборудованияСрезПоследних.ФизЛицо
	|	КОНЕЦ КАК ФизЛицо,
	|	СвязанноеОборудованиеСрезПоследних.ОборудованиеПодчиненное.ПараметрОборудования КАК НомерТелефона,
	|	ВЗ_КомплектыОборудования.Транспорт КАК Транспорт,
	|	ДополнительныеПараметрыТранспортаСрезПоследних.ФорматАвтотранспорта КАК ТипАвто
	|ИЗ
	|	Справочник.Оборудование КАК Т_Оборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(, Оборудование = &Ссылка) КАК УчетОборудованияСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОборудования.СрезПервых(, Оборудование = &Ссылка) КАК СтатусыОборудованияСрезПервых
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанноеОборудование.СрезПоследних(
	|				,
	|				ОборудованиеВладелец = &Ссылка
	|					И ОборудованиеПодчиненное.МодельОборудования = ЗНАЧЕНИЕ(Справочник.МоделиОборудования.SIMКарта)) КАК СвязанноеОборудованиеСрезПоследних
	|		ПО (СвязанноеОборудованиеСрезПоследних.СтатусМонтирования = ЗНАЧЕНИЕ(Перечисление.СтатусыМонтированияОборудования.Смонтировано))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			КомплектыОборудованияСрезПоследних.Транспорт КАК Транспорт
	|		ИЗ
	|			РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудованияСрезПоследних
	|		ГДЕ
	|			КомплектыОборудованияСрезПоследних.Оборудование = &Ссылка
	|		
	|		УПОРЯДОЧИТЬ ПО
	|			КомплектыОборудованияСрезПоследних.Период УБЫВ,
	|			КомплектыОборудованияСрезПоследних.Регистратор УБЫВ) КАК ВЗ_КомплектыОборудования
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних КАК ДополнительныеПараметрыТранспортаСрезПоследних
	|			ПО ВЗ_КомплектыОборудования.Транспорт = ДополнительныеПараметрыТранспортаСрезПоследних.Транспорт
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Т_Оборудование.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Статус = Выборка.Статус;
	ФизЛицо = Выборка.ФизЛицо;
	НомерТелефона = Выборка.НомерТелефона;
	Транспорт = Выборка.Транспорт;
	ТипАвто = Выборка.ТипАвто;
	
	Если Транспорт.Пустая() Тогда
		Элементы.РазукомплектоватьОборудование.Видимость = Ложь;
	Иначе
		Элементы.РазукомплектоватьОборудование.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельОборудованияПриИзменении(Элемент)
	
	МодельОборудованияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МодельОборудованияПриИзмененииНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = Объект.МодельОборудования;
	Иначе
		ЗаполнитьДанныеОборудования();
	КонецЕсли; 
	
	ТипОборудованияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипОборудованияПриИзмененииНаСервере()
	
	ТипОборудования = Объект.МодельОборудования.ТипОборудования;
	ДоступностьSIM = ТипОборудования = Перечисления.ТипыОборудования.Смартфон Или ТипОборудования = Перечисления.ТипыОборудования.Планшет;
	//Элементы.ФормаSIM.Доступность = ДоступностьSIM;
	Элементы.ФормаСправочникОборудованиеУстановитьSIMКарту.Доступность = ДоступностьSIM;
	Элементы.ФормаСправочникОборудованиеДемонтироватьSIMКарту.Доступность = ДоступностьSIM;
	//Асеев 25.04.2024 (Задача № 5265)>>>
	Элементы.НомерТелефона.Видимость = ДоступностьSIM;
	//Асеев 25.04.2024 (Задача № 5265)<<<
	
КонецПроцедуры

&НаКлиенте
Процедура РазукомплектоватьОборудование(Команда)
	
	//Асеев 10.12.2024 (Задача № 5341)>>>
	ПоказатьВопрос(Новый ОписаниеОповещения("РазукомплектоватьОборудованиеЗавершение", ЭтотОбъект), "Вы действительно хотите разукомплектовать данное оборудование?", РежимДиалогаВопрос.ДаНет);
	//Асеев 10.12.2024 (Задача № 5341)<<<
	
КонецПроцедуры

&НаКлиенте
Процедура РазукомплектоватьОборудованиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//Асеев 10.12.2024 (Задача № 5341)>>>
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", Новый Структура("Транспорт,ТипОборудования,Оборудование,РазукомплектацияОборудования", Транспорт, ТипОборудования, Объект.Ссылка, Истина));
	
	ОткрытьФорму("Документ.СведенияОКомплектеОборудования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("СведенияОКомплектеОборудованияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Асеев 10.12.2024 (Задача № 5341)<<<
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКомплектеОборудованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьДанныеОборудования();
	
КонецПроцедуры
